

Задание 1: Напиши программу, выводящую на экран сообщение "Привет, мир!"
"""

print('Привет, мир!')

"""Задание 2: Напиши программу которая запрашивает имя пользователя и выводит сообщение:

`Привет, <Имя пользователя>`
"""

name = input(' ')
print('Привет', name)

"""Задание 3: Напиши программу определяющую является ли число четным или нечетным:

Пример:

`Введите число:` 2

`Ваше число четное!`
"""

s = int(' ')
if s % 2 == 0:
  print('Число четное')
else:
  print('Число нечетное')

"""Задание 4: Напишите программу которая запрашивает длинну и ширину прямоугольника и выводит его площадь:



`Введите длинну прямоугольника:`

`Введите ширину прямоугольника:`

`Площадь прямоугольника: `


"""

a = 12
print('Введите длинну прямоугольника:', a)
b = 12
print('Введите ширину прямоугольника:', b)
b = 12
s = a * b
print(s)

"""Задание 5: Напишите программу, которая будет вычислять среднее арифметическое введенных чисел"""

n = [1, 5, 8]
sr = sum(n)//len(n)
print(sr)

"""# Практика 0.2.1

**Шахматы**

Даны стартовые и конечные координаты, а также фигура

Необходимо определить, может ли заданная фигура так ходить?
"""



"""# Практика 0.2.2

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции
"""

